Load some data into OLTP tables

In [0]:
INSERT INTO GAMESTORE.dbo.GAMELIST
SELECT 1,'GTA1','JAPAN',20,1,1,1,1,1,'Sam','',''
UNION ALL
SELECT 2,'GTA2','JAPAN',60,1,1,1,1,1,'Sam','',''
UNION ALL
SELECT 3,'GTA3','KOREA',80,1,1,1,1,1,'Sam','',''
UNION ALL
SELECT 4,'GTA4','JAPAN',160,1,1,1,1,1,'Sam','',''
UNION ALL
SELECT 5,'GTA5','JAPAN',180,1,1,1,1,1,'Sam','',''


INSERT INTO GAMESTORE.DBO.CUSTOMER
SELECT 1,'Wade','1980-01-01', 1, 'China'
UNION ALL
SELECT 2,'James', '1981-01-01', 1, 'USA'
UNION ALL
SELECT 3, 'Wege', '1985-01-01', 1, 'Germany'


INSERT INTO GAMESTORE.DBO.[ORDER]
SELECT 1, '2010-01-01', 1, 2
UNION ALL
SELECT 2, '2010-02-01', 1, 3
UNION ALL
SELECT 3, '2010-01-01', 2, 1
UNION ALL
SELECT 4, '2010-01-02', 3, 2
UNION ALL
SELECT 5, '2010-02-03', 4, 3
UNION ALL
SELECT 6, '2010-01-01', 5, 1